#+author: Neil Lin

*** Install

The following commands are what I was trying to have a good =vterm-module= to make =vterm= working.

First, when I was typing the command =M-x vterm=, the Emacs showed me this message:

#+begin_example
Vterm needs `vterm-module' to work.  Compile it now? (y or n)
#+end_example

I click =y= to proceed, then message showed again for another error:

#+begin_example
Vterm needs CMake to be compiled. Please, install CMake
#+end_example

So I jumped into the terminal and type these command to install dependent tools (see [[https://github.com/akermu/emacs-libvterm#requirements][akermu/emacs-libvterm]]):

#+begin_src shell
brew install cmake
brew install libvterm
#+end_src

I'm not sure whether the =perl= is mandatory:

#+begin_src shell
brew install --build-from-source perl
#+end_src

But I still got the same message complaining about no =CMake= at all.

Finally I stumbled onto this [[https://github.com/akermu/emacs-libvterm/issues/169][thread]] and found that I have to build =vterm-module= by myself on terminal:

#+name: vterm-path
#+begin_src shell
ls "$HOME/.emacs.d/elpa" | grep vterm
#+end_src

#+RESULTS: vterm-path
: vterm-20210217.737

#+begin_src shell :var vterm_path=vterm-path :results output
cd "$HOME/.emacs.d/elpa/$vterm_path"
mkdir -p build
cd build
/usr/local/bin/cmake ..
make
#+end_src

#+RESULTS:
: -- System libvterm detected
: -- Configuring done
: -- Generating done
: -- Build files have been written to: /Users/lab/.emacs.d/elpa/vterm-20210217.737/build
: [100%] Built target vterm-module

Then =vterm= worked!

[2021-03-03 Wed] sometimes you still face an issue when running =make= command, try to update XCode command line tool to solve it:

#+begin_src shell
xcode-select --install
#+end_src

#+RESULTS:

